Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Возвращает Вх.Строка, в которой НомерЧасти-ое вхождение выражения Рег.Выр. будет заменено на СтрокаЗамены. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the InputString in which the MatchIndex-th occurrence of the RegularExpression will be replaced with the ReplaceString. The PCRE2 library is used. Syntax and semantics are compatible with Perl regular expressions.

source: Рег.Выр. - строка регулярного выражения; Вх.Строка - входная строка, которая будет подвержена замене; СтрокаЗамены - строка, которая будет вставлена вместо частей входной строки, соответствующих регулярному выражению; Расш.Синтаксис - расширенный синтаксис замены (используется библиотека PCRE2).
en: RegularExpression - the regular expression string; InputString - the input string that will be replaced; ReplaceString - the string that will be inserted instead of the input string parts matching the regular expression; ExtendedSyntax - extended replacement syntax (The PCRE2 library is used).

source: RegExReplaceAll(Рег.Выр., Вх.Строка, СтрокаЗамены [, Расш.Синтаксис = False])
en: RegExReplaceAll(RegularExpression, InputString, ReplaceString [, ExtendedSyntax = False])

source: Возвращает Вх.Строка, в которой все вхождения выражения Рег.Выр. будут заменены на СтрокаЗамены. Используется библиотека PCRE2. Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Returns the InputString in which all occurrences of the RegularExpression expression will be replaced with the ReplaceString. PCRE2 library is used. Syntax and semantics are compatible with the Perl regular expressions.

source: Степени_свободы - число степеней свободы. Аргумент - значение, для которого требуется вычислить плотность вероятности.
en: Degrees_of_freedom - the number of the degrees of freedom. Argument - the value for which the probability density should be calculated.

source: DChi2(Степени_свободы, Аргумент)
en: DChi2(Degrees_of_freedom, Argument)

source: Функция плотности распределения хи-квадрат. Возвращает плотность вероятности.
en: The density function of the chi-square gamma distribution. The function returns probability density.

source: Степени_свободы - число степеней свободы. Аргумент - значение, для которого требуется вычислить вероятность.
en: Degrees_of_freedom - the number of the degrees of freedom. Argument - the value for which the probability should be calculated.

source: FChi2(Степени_свободы, Аргумент)
en: FChi2(Degrees_of_freedom, Argument)

source: Функция распределения хи-квадрат. Возвращает левостороннюю вероятность распределения хи-квадрат P(X <= Аргумент).
en: The chi-square distribution function. Returns the left-sided probability of chi-square distribution P(X <= Argument).

source: Степени_свободы - число степеней свободы. Вероятность - значение функции распределения хи-квадрат.
en: Degrees_of_freedom - the number of the degrees of freedom. Probability - the value of the chi-square distribution function.

source: InvChi2(Степени_свободы, Вероятность)
en: InvChi2(Degrees_of_freedom, Probability)

source: Функция, обратная функции распределения хи-квадрат. Возвращает пороговое значение x, для которого функция вероятности имеет значение Вероятность. Если p=FChi2(N, x), то InvChi2(N, p) = x.
en: The inverse chi-square distribution function. Returns the threshold value x, for which the probability function takes the value Probability. If p=FChi2(N, x), then InvChi2(N, p) = x.

source: Функция возвращает номер текущей строки источника данных. Нумерация строк начинается с 0.
en: Function returns the current row number of the data source. Row numbering starts from 0.

source: PChi2(Степени_свободы, Аргумент)
en: PChi2(Degrees_of_freedom, Argument)

source: Дополнительная функция распределения хи-квадрат. Возвращает правостороннюю вероятность распределения хи-квадрат P(X > Аргумент).
en: An additional chi-square distribution function. Returns the right-sided probability of chi-square distribution P(X > Argument).

source: ПутьУзла - путь узла, переменной или выражения
en: NodePath - the path to a node, variable or expression

source: DisplayName(["ПутьУзла"])
en: DisplayName(["NodePath"])

source: Функция возвращает метку (отображаемое имя) по пути узла, переменной или выражения. Если функция вызывается без аргументов, то она возвращает метку текущего вычисляемого выражения. Примечание: ПутьУзла - строковое значение, т.е. явно заданное ПутьУзла должно быть указано в кавычках. Например: DisplayName("Root.Node1")
en: The function returns the caption (display name) based on the path to a node, variable or expression. If the function is activated without arguments, it returns the caption of the expression being currently computed. Note: NodePath is a string value, so an explicitely specified NodePath must be in quotes. For example: DisplayName("Root.Node1")

source: Функция возвращает число выражений внутри массива.
en: The function returns the number of expressions within an array.

source: ИмяПоля - поле, по которому необходимо получить значение показателя Тип - показатель статистики, который необходимо получить
en: FieldName - the field for which to obtain the indicator value Type - the statistics indicator to be obtained

source: Функция возвращает индекс выражения внутри массива. Нумерация начинается с 0.
en: The function returns the index of an expression within an array. The numbering starts with 0.

source: Функция возвращает путь от корня дерева до выражения.
en: The function returns the path from the tree root to the expression.

source: Функция возвращает родительский узел текущего узла выражения.
en: The function returns the parent node of the expression's current node.

source: ИмяПеременной - имя переменной или выражения
en: VariableName - the name of a variable or an expression

source: DisplayName(["ИмяПеременной"])
en: DisplayName(["VariableName"])

source: Stat("ИмяПоля", "Тип")
en: Stat("FieldName", "Type")

source: Функция возвращает метку (отображаемое имя) по имени переменной или выражения. Если функция вызывается без аргументов, то она возвращает метку текущего вычисляемого выражения. Примечание: ИмяПеременной - строковое значение, т.е. явно заданное ИмяПеременной должно быть указано в кавычках. Например: DisplayName("VAR1")
en: The function returns the caption (display name) based on the name of a variable or an expression. If the function is activated without arguments, it returns the caption of the expression being currently computed. Note: VariableName is a string value, so an explicitely specified VariableName must be in quotes. For example: DisplayName("VAR1")

source: Функция возвращает значение одного из статистических показателей. Тип может принимать одно из следующих значений: Min - минимальное значение Max - максимальное значение Avg - среднее значение StdDev - стандартное отклонение Sum - сумма значений SumSq - сумма квадратов значений Count - количество значений UniqueCount - количество уникальных значений NullCount - количество пропущенных значений Mode - мода (значение, которое встречается наиболее часто) Примечание: ИмяПоля и Тип - строковые значения, т.е. явно заданные ИмяПоля и Тип должны быть указаны в кавычках. Например: Stat("COL1", "Min")
en: Function returns the value of one of the statistical indicators. The type can adopt one of the following values: Min - minimum value Max - maximum value Avg - average value StdDev - standard deviation Sum - sum of values SumSq - sum of square values Count - count of values UniqueCount - count of unique values NullCount - count of null values Mode - most frequently occurring value Note: FieldName and Type - string values, namely, explicitly given FieldName and Type must be in quotation marks. For example: Stat("COL1", "Min")

source: Abs(Аргумент)
en: Abs(Argument)

source: Возвращает модуль аргумента.
en: Returns the absolute value of argument.

source: AbsErr(Аргумент1, Аргумент2)
en: AbsErr(Argument1, Argument2)

source: Возвращает абсолютную погрешность двух аргументов.
en: Returns the absolute error of two arguments.

source: Дата - аргумент типа Дата/Время Количество - аргумент целого типа.
en: Date - a Date/Time type argument Number - an argument of the integer type.

source: AddDay(Дата, Количество)
en: AddDay(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество дней. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество дней раньше указанной даты.
en: The function returns the value of argument Date increased by the specified Number of days. The number can also be negative, in this case, the function returns an earlier date by subtracting the specified number of days from the given date.

source: AddHour(Дата, Количество)
en: AddHour(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество часов. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество часов раньше указанной даты.
en: The function returns the value of the argument Date increased by the specified Number of hours. The number can also be negative, in this case, the function returns the relevant earlier date by subtracting the specified number of hours from the given date.

source: AddMillisecond(Дата, Количество)
en: AddMillisecond(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество миллисекунд. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество миллисекунд раньше указанной даты.
en: The function returns the value of the argument Date increased by the specified Number of milliseconds. The number can also be negative, in this case, the function returns the relevant earlier date by subtracting the specified number of milliseconds from the given date.

source: AddMinute(Дата, Количество)
en: AddMinute(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество минут. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество минут раньше указанной даты.
en: The function returns the value of the argument Date increased by the specified Number of minutes. The number can also be negative, in this case, the function returns the relevant earlier date by subtracting the specified number of minutes from the given date.

source: AddMonth(Дата, Количество)
en: AddMonth(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество месяцев. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество месяцев раньше указанной даты. Если указанный день месяца больше, чем последний день получившегося месяца, то функция устанавливает дату на последний день получившегося месяца.
en: Function returns the Date argument value, increased by the specified Number of months. The number can also be negative. In this case, the function will return the date to the given number of months before the specified date. If the specified day of the month exceeds the last day of the resulting month, the function will set the date to the last day of the resulting month.

source: AddQuarter(Дата, Количество)
en: AddQuarter(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество кварталов. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество кварталов раньше указанной даты. Если указанный день месяца больше, чем последний день месяца получившегося квартала , то функция устанавливает дату на последний день месяца получившегося квартала.
en: Function returns the Date argument value, increased by the specified Number of quarters. The number can also be negative. In this case, the function will return the date to the given number of quarters before the specified date. If the specified day of the month exceeds the last day of the resulting quarter, the function will set the date to the last day of the resulting quarter.

source: Функция возвращает серийный номер электронного ключа.
en: Function returns the serial number of the dongle key.

source: AddSecond(Дата, Количество)
en: AddSecond(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество секунд. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество секунд раньше указанной даты.
en: The function returns the value of the argument Date increased by the specified Number of seconds. The number can also be negative, in this case, the function returns the relevant earlier date by subtracting the specified number of seconds from the given date.

source: AddWeek(Дата, Количество)
en: AddWeek(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество недель. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество недель раньше указанной даты.
en: Function returns the Date argument value, increased by the specified Number of weeks. The number can also be negative. In this case, the function will return the date to the given number of weeks before the specified date.

source: AddYear(Дата, Количество)
en: AddYear(Date, Number)

source: Функция возвращает значение аргумента Дата, увеличенного на указанное Количество лет. Количество может быть и отрицательным, тогда функция возвратит дату на указанное количество лет раньше указанной даты.
en: Function returns the Date argument value, increased by the specified Number of years. The number can also be negative. In this case, the function will return the date to the given number of years before the specified date.

source: Аргументы - числовые выражения.
en: Arguments - numeric expressions.

source: Строка - строка, для которой рассчитывается MD5 значение.
en: String - a string for which the MD5 value is calculated.

source: AMGD(Стоимость, Остаточная_стоимость, Время_эксплуатации, Период)
en: AMGD(Cost, Residual_cost, Operating_time, Period)

source: Возвращает годовую амортизацию имущества для указанного периода.
en: Returns the annual property depreciation for the specified period.

source: Значение - значение косинуса, для которого необходимо найти угол.
en: Value - the value of the cosine whose angle should be found.

source: ArcCos(Значение)
en: ArcCos(Value)

source: Возвращает арккосинус значения, т.е. угол в радианах, косинус которого равен Значение.
en: Returns the arccosine of the value, i.e., the angle in radians whose cosine is the Value.

source: Значение - значение синуса, для которого необходимо найти угол.
en: Value - the value of the sine whose angle should be found.

source: ArcSin(Значение)
en: ArcSin(Value)

source: Возвращает арксинус значения, т.е. угол в радианах, синус которого равен Значение.
en: Returns the arcsine of the value, i.e., the angle in radians whose sine is the Value.

source: Значение - значение тангенса, для которого необходимо найти угол.
en: Value - the value of the tangent whose angle should be found.

source: ArcTan(Значение)
en: ArcTan(Value)

source: MD5(Строка)
en: MD5(String)

source: Возвращает арктангенс значения, т.е. угол в радианах, тангенс которого равен Значение.
en: Returns the arctangent of the value, i.e., the angle in radians whose tangent is the Value.

source: C - постоянная, A0 ... An - коэффициенты регрессии, X(t) ... X(t-n) - значения ряда.
en: C - constant, A0 ... An - regression coefficients, X(t) ... X(t-n) - series values.

source: Применяется для построения пользовательской модели авторегрессии вида Прогноз = С + A0 * X(t) + A1 * X(t-1) + ...
en: Used for the construction of the user model of the following autoregression type: Prediction = C + A0 * X(t) + A1 * X(t-1) + ...

source: Avg(Аргумент1, Аргумент2 ...)
en: Avg(Argument1, Argument2 ...)

source: Возвращает среднее арифметическое аргументов.
en: Returns the arithmetic mean of arguments.

source: Аргумент - числовой код символа Unicode.
en: Argument - numerical code of Unicode character.

source: Chr(Аргумент)
en: Chr(Argument)

source: Возвращает символ Unicode по его коду.
en: Returns Unicode character according to its code.

source: Функция возвращает HEX значение MD5, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the MD5 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: Регулярные выражения
en: Regular expressions

source: Значение не соответствует используемому типу
en: Value does not comply with used type

source: Ошибка источника замен
en: Replacements source error

source: Отсутствует источник замен с Guid {0}
en: No replacement source with Guid {0}

source: На пропущенное
en: With empty

source: Не заменять
en: Do not replace

source: На регулярное выражение
en: With regular expression

source: На значение
en: With value

source: Информационное
en: Info

source: Значение
en: Value

source: Тайм-аут блокировки сессии (сек)
en: Session lock timeout (s)

source: Замена
en: Replace

source: Не используемое
en: Not used

source: Невозможно отобразить уникальные значения в количестве больше {0}
en: Failed to show the unique values number of which exceeds {0}

source: Отключено (0)
en: (0) disabled

source: Тип данных поля входного набора {0} несовместим с телом запроса
en: Data type of the input dataset field {0} is incompatible with request body

source: Автоматическое связывание
en: Auto Link

source: Будет выполнена автоматическая расстановка связей по метке поля и типу данных. Уже настроенные связи будут удалены.
en: Links will be automatically mapped by field caption and data type. Already configured links will be deleted.

source: Удалить все связи?
en: Do you want to delete all links?

source: Удалить
en: Delete

source: Удаление
en: Delete

source: URL для загрузки изображений
en: URL for loading images

source: Поле входного набора "{0}" назначено несуществующему параметру "{1}"
en: Input dataset field "{0}" has been assigned for nonexistent parameter "{1}"

source: Тип данных поля входного набора "{0}" несовместим с параметром "{1}"
en: Data type of the input dataset field "{0}" is incompatible with parameter "{1}"

source: Не настроен порт подключения к REST-сервису
en: Port of connection to REST service not configured

source: Сэмплированное
en: Sampled

source: Не выбран
en: Not selected

source: Не выбрана
en: Not selected

source: Учитывать регистр
en: Case-sensitive

source: Поле уже используется
en: Field already used

source: Отменить сортировку всех полей?
en: Do you want to cancel all fields sorting?

source: Отменить сортировку поля "{0}"?
en: Do you want to cancel "{0}" field sorting?

source: URL префиксы, с которых разрешена загрузка изображений для Markdown
en: URL Prefixes Allowed for Image Load in Markdown

source: Отмена сортировки
en: Cancel Sort

source: По возрастанию
en: Ascending

source: По убыванию
en: Descending

source: Входное поле "{0}" не найдено
en: "{0}" input field not found

source: Отменить сортировку для выбранных полей?
en: Do you want to cancel sorting for selected fields?

source: Не учитывать регистр
en: Case-insensitive

source: Автоопределение
en: Autodetect

source: Значение должно быть целым числом
en: The value must be an integer

source: {0} имени поля в скрипте: существует также переменная с именем '{1}', при исполнении скрипта будет использовано поле из набора данных.
en: {0} of field name in script: a variable with name '{1}' also exists. When running the script, the field from the dataset will be used.

source: {0} переменной в скрипте: нельзя использовать переменную с именем '{1}' в скрипте, потому что существует такое же поле из набора данных.
en: {0} of variable in script: the variable with name '{1}' cannot be used in script, as the same field exists in the dataset.

source: Значение должно быть восьмеричным числом от 000 до 777
en: The value must be an octal number from 000 to 777

source: Каждую строку
en: Each row

source: Управляется скриптом
en: Controlled by the script

source: Весь набор данных
en: Entire dataset

source: Выполнять скрипт для каждой строки входного набора
en: Run script for each input set row

source: Игнорировать ошибки при выполнении скрипта
en: Ignore errors when running script

source: Глобальный индекс узла
en: Global node index

source: Удалить и продолжить
en: Delete and continue

source: Типы данных полей для определения порядка следования данных должны совпадать
en: Field data types for data sequentializing must match

source: Не задано разгруппируемое поле
en: Ungroupable field not selected

source: Параметры LDAP
en: LDAP parameters

source: Не задано поле для разыменования разгруппированных значений
en: No field for ungrouped values dereference selected

source: Не задано поле для расчета долей
en: No field for quotas calculation selected

source: Не задано поле с долями
en: No field with quotas selected

source: Не заданы поля для определения порядка следования данных
en: No fields for data sequentializing selected

source: Не определено ни одной связи
en: No links defined

source: Отсутствующие поля
en: Missing fields

source: Колонка не выбрана
en: No column selected

source: Поле с наименованиями
en: Field with names

source: Поле с долями
en: Field with quotas

source: Обнаружены связи с несуществующими объектами. Вы хотите удалить все потерянные связи и продолжить?
en: Links with nonexistent objects were found. Do you want to delete all lost links and continue?

source: Лимит
en: Limit

source: Точность после запятой
en: Decimal place accuracy

source: Кратность
en: Multiplicity

source: Параметр округления
en: Rounding parameter

source: Порядковое поле
en: Ordinal field

source: Разгруппируемое
en: Ungroupable

source: Не выбрано
en: Not selected

source: Не удалять и продолжить
en: Continue without deleting

source: Корневой узел выходного дерева - это массив, содержащий корневые узлы деревьев изо всех активных входных портов.
en: The output tree root node is an array containing root nodes of trees from all active input ports.

source: URL для формирования ссылок
en: URL for generating links

source: Выходное дерево содержит те же данные, что и дерево в первом активном входном порту.
en: The output tree contains the same data as the tree from the first active input port.

source: Каждой переменной будет соответствовать отдельное поле таблицы.
en: Each variable will create a new field in the table.

source: Каждой переменной будет соответствовать отдельная запись таблицы.
en: Each variable will create a new record in the table.

source: Часть:
en: Part:

source: Обнаружена невалидная связь поля "{0}" с запросом "{1}"
en: Invalid link of "{0}" field with "{1}" request has been found

source: URL префиксы, которые могут быть использованы для ссылок в Markdown
en: URL Prefixes Allowed for Links in Markdown

source: Обнаружена множественная связь запроса "{0}" с полем "{1}", которая будет удалена
en: Multiple link of "{0}" request with "{1}" field has been found and it willl be deleted

source: не связано
en: not linked

source: Папка "{0}", указанная в качестве расположения для сохранения запросов, не существует
en: "{0}" folder selected to save requests does not exist

source: Файл "{0}", указанный в качестве источника ответа, не существует
en: "{0}" file selected as response source does not exist

source: Обрабатываемое исключение:
en: Handled exception:

source: Настройка обрабатываемых исключений
en: Configure Exceptions Handled

source: Настройка ответа сервиса
en: Configure Service Response

source: Сообщение:
en: Message:

source: Подключение к Web-сервису не активно
en: Connection to the web service is not active
